INSERT INTO city (name, region_name, country_code, latitude, longitude)
VALUES
    ('Москва', 'Москва', 'RU', 55.7558, 37.6173),
    ('Санкт-Петербург', 'Ленинградская область', 'RU', 59.9343, 30.3351),
    ('Новосибирск', 'Новосибирская область', 'RU', 55.0084, 82.9357),
    ('Екатеринбург', 'Свердловская область', 'RU', 56.8389, 60.6057),
    ('Казань', 'Республика Татарстан', 'RU', 55.7887, 49.1221);

INSERT INTO location (city_id, title, address_line, postal_code, latitude, longitude)
VALUES
    ((SELECT id FROM city WHERE name = 'Москва' AND region_name = 'Москва'),
     'Красная площадь', 'Красная площадь, 1', '109012', 55.7536, 37.6212),

    ((SELECT id FROM city WHERE name = 'Санкт-Петербург' AND region_name = 'Ленинградская область'),
     'Дворцовая площадь', 'Дворцовая площадь, 1', '191186', 59.9398, 30.3159),

    ((SELECT id FROM city WHERE name = 'Новосибирск' AND region_name = 'Новосибирская область'),
     'Площадь Ленина', 'Площадь Ленина, 1', '630099', 55.0302, 82.9204),

    ((SELECT id FROM city WHERE name = 'Екатеринбург' AND region_name = 'Свердловская область'),
     'Площадь 1905 года', 'Площадь 1905 года, 1', '620014', 56.8393, 60.5992),

    ((SELECT id FROM city WHERE name = 'Казань' AND region_name = 'Республика Татарстан'),
     'Кремлёвская набережная', 'Кремлёвская набережная, 1', '420014', 55.7966, 49.1066);